<?php 
$a = ['пн', 256, 'ср', 34, 38, 'сб', 95];
echo $a[0]; // пн
print $a[0]; // пн

var_dump($a);
print_r($a); // Array ( [0] => пн [1] => вт [2] => ср [3] => чт [4] => пт [5] => сб [6] => вс )

// ------------- Ассоциативный массив ---------------

$a = [1=>'пн', 2=>'вт', 3=>'ср', 4=>'чт', 5=>'пт', 6=>'сб', 7=>'вс'];
echo $a[1]; // 'пн'

$a = ['Коля'=>200, 'Вася'=>300, 'Петя'=>400];
echo $a['Вася']; // 300

$a = [1=>'пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
echo $a[3]; // 'ср'

$a[] = 100; //100 будет иметь ключ 0
$a[] = 200; //200 будет иметь ключ 1
$a[] = 300; //300 будет иметь ключ 1
var_dump($a); //массив $a будет иметь вид [0=>100, 1=>200, 2=>300]

// ------------ Многомерный массив -------------------
$a = [
		'boys' => ['Коля', 'Вася', 'Петя'],
		'girls' => ['Даша', 'Маша', 'Лена'],
	];
echo $a['boys'][0] // 'Коля'
 ?>